# Nested Cindition = เงื่อนไขซ้อนเงื่อนไข

print("\n\n        คุณมีบัญชีหรือยัง? ถ้ายังรีบสมัครเดี๋ยวนี้เลยนะ"
      "\n...ความติ่งจะเริ่มสนุกขึ้นหลังจากคุณได้เข้ามาในโลกแห่งนี้...\n")

newuser = input(" Username : ")
newpassword = input(" Password : ")
mail = newuser
password = newpassword
print(" ยินดีด้วยคุณได้ลงทะเบียนเสร็จเรียบร้อยแล้ว"
      "\n กรุณาล็อกอินเพื่อเข้าไปสู่โลกแห่ง K-POP ")
username = input(" Username : ")
passwordforlogin = input(" Password : ")
vat = 7

if username == mail and passwordforlogin == password:
    print("\n\nWelcome to Fujiko Music"
          "\n\n คุณสามารถเลือกรายการได้ดังต่อไปนี้"
          "\n 1.ต้องการซื้อบัตรคอนเสิร์ต K-POP"
          "\n 2.ต้องการดูประวัตินักร้อง K-POP")
    menu = int(input("\n ตัวเลือกของคุณคือ : "))
    if menu == 1:
        print(" เรามีสินค้าให้คุณเลือกดังนี้"
              "\n 1.บัตรคอนเสิร์ต Got 7       : 4,000 - 7,000 $"
              "\n 2.บัตรคอนเสิร์ต Black pink  : 5,000 - 12,000 $"
              "\n 3.บัตรคอนเสิร์ต BTS         : 6,000 - 14,000 $")
        menuCard = int(input("\n ตัวเลือกของคุณคือ : "))

        if menuCard == 1:
            print(" บัตรคอนเสิร์ต Got 7       : 4,000 - 7,000 $"
                  "\n เรามีสินค้าให้คุณเลือกดังนี้"
                  "\n 1.บัตรคอนเสิร์ต Got 7  / Classic     : 4,000 $"
                  "\n 2.บัตรคอนเสิร์ต Got 7  / Gold        : 5,500 $"
                  "\n 3.บัตรคอนเสิร์ต Got 7  / Platinum    : 7,000 $")
            gread = int(input("\n ตัวเลือกของคุณคือ : "))
            if gread == 1:
                got7C = 4000 * vat / 100
                got7C1 = 4000 + got7C
                print(" ยอดชำระทั้งหมด : ", got7C1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            elif gread == 2:
                got7G = 5500 * vat / 100
                got7G1 = 5500 + got7G
                print(" ยอดชำระทั้งหมด : ", got7G1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            elif gread == 3:
                got7P = 7000 * vat / 100
                got7P1 = 7000 + got7P
                print(" ยอดชำระทั้งหมด : ", got7P1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            else:
                print(" ERROR")

        if menuCard == 2:
            print(" บัตรคอนเสิร์ต Blackpink  : 5,000 - 12,000 $"
                  "\n เรามีสินค้าให้คุณเลือกดังนี้"
                  "\n 1.บัตรคอนเสิร์ต Blackpink  / Classic     : 5,000 $"
                  "\n 2.บัตรคอนเสิร์ต Blackpink  / Gold        : 9,500 $"
                  "\n 3.บัตรคอนเสิร์ต Blackpink  / Platinum    : 12,000 $")
            gread = int(input("\n ตัวเลือกของคุณคือ : "))
            if gread == 1:
                bpC = 5000 * vat / 100
                bpC1 = 5000 + bpC
                print(" ยอดชำระทั้งหมด : ", bpC1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            elif gread == 2:
                bpG = 9500 * vat / 100
                bpG1 = 9500 + bpG
                print(" ยอดชำระทั้งหมด : ", bpG1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            elif gread == 3:
                bpP = 12000 * vat / 100
                bpP1 = 12000 + bpP
                print(" ยอดชำระทั้งหมด : ", bpP1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            else:
                print(" ERROR")

        if menuCard == 3:
            print(" บัตรคอนเสิร์ต BTS         : 6,000 - 14,000 $"
                  "\n เรามีสินค้าให้คุณเลือกดังนี้"
                  "\n 1.บัตรคอนเสิร์ต BTS  / Classic     : 6,000 $"
                  "\n 2.บัตรคอนเสิร์ต BTS  / Gold        : 8,500 $"
                  "\n 3.บัตรคอนเสิร์ต BTS  / Platinum    : 11,000 $"
                  "\n 4.บัตรคอนเสิร์ต BTS  / Vip         : 14,000 $")
            gread = int(input("\n ตัวเลือกของคุณคือ : "))
            if gread == 1:
                btsC = 6000 * vat / 100
                btsC1 = 6000 + btsC
                print(" ยอดชำระทั้งหมด : ", btsC1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            elif gread == 2:
                btsG = 8500 * vat / 100
                btsG1 = 8500 + btsG
                print(" ยอดชำระทั้งหมด : ", btsG1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            elif gread == 3:
                btsP = 11000 * vat / 100
                btsP1 = 11000 + btsP
                print(" ยอดชำระทั้งหมด : ", btsP1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            elif gread == 4:
                btsV = 14000 * vat / 100
                btsV1 = 14000 + btsV
                print(" ยอดชำระทั้งหมด : ", btsV1,
                      "\n คุณสามารถชำระเงินได้ทาง ธ.กรุงเทพ 111-111-1111"
                      "\n ชื่อบัญชี นาย ก  เอ้ย ก ไก่ "
                      "\n ---------------------"
                      "\n Thank you so much"
                      "\n ---------------------")
            else:
                print(" ERROR")



    if menu == 2:
        print(" เรามีวงให้คุณเลือกดังนี้"
              "\n 1.Got 7 "
              "\n 2.Blackpink"
              "\n 3.BTS ")
        menuband = int(input("\n ตัวเลือกของคุณคือ : "))
        if menuband == 1:
            print(" เรามีรายชื่อให้คุณเลือกดังนี้"
                  "\n 1.JB"
                  "\n 2.Mark"
                  "\n 3.Jackson"
                  "\n 4.Jr.  "
                  "\n 5.ชเวยองแจ "
                  "\n 6.แบมแบม "
                  "\n 7.Kim ")
            menuName = int(input("\n ตัวเลือกของคุณคือ : "))
            if menuName == 1:
                print("\n\n             JB"
                      "\n\n ชื่อ : JB (Im Jae Bum) อิมแจบอม"
                      "\n วันเกิด : 6 มกราคม 1994"
                      "\n ส่วนสูง : 179 ซม. "
                      "\n น้ำหนัก : 66 กก."
                      "\n การศึกษา : Konkuk University's Film Department"
                      "\n กรุ๊ปเลือด : A"
                      "\n งานอดิเรก : ท่องเที่ยวด้วยรถบัส, ดูหนัง, สูดอากาศบริสุทธิ์, มองหาร้านอาหาร, ถ่ายรูป"
                      "\n ความสามารถพิเศษ : บีบอย"
                      "\n ผู้หญิงในอุดมคติ : คนที่ดึงดูดสายตาและกุมหัวใจเขาได้"
                      "\n อาหารโปรด : แกงเกาหลี"
                      "\n ศิลปินคนโปรด : D'Angelo"
                      "\n\n ตำแหน่งหัวหน้าวง JB รับหน้าที่พิเศษเป็นเจ้าของภาพลักษณ์ด้านความชิค "
                      "เคยมีผลงานเพลงในฐานะสมาชิก JJ Project มาแล้วก่อนหน้านี้"
                      "\n ----------------------------------------------------------------")
            elif menuName == 2:
                print("\n\n                MARK"
                      "\n\n ชื่อ : Mark (Mark Yl-En Tuan) มาร์ค ต้วน"
                      "\n วันเกิด : 4 กันยายน 1993"
                      "\n ส่วนสูง : 175 ซม. "
                      "\n น้ำหนัก : 59 กก. "
                      "\n การศึกษา : จบการศึกษาเกรด 10 จาก Arcadia High School (California)"
                      "\n กรุ๊ปเลือด : A"
                      "\n งานอดิเรก : สเกตบอร์ด, สโนว์บอร์ด"
                      "\n ความสามารถพิเศษ : ศิลปะการต่อสู้"
                      "\n ผู้หญิงในอุดมคติ : ผู้หญิงที่ทำให้รู้สึกอยากอยู่ด้วย"
                      "\n อาหารโปรด : แฮมเบอร์เกอร์, เนื้อ"
                      "\n ศิลปินคนโปรด : Chris Brown, Drake, ASAP Rocky, Tyga"
                      "\n\n แม้จะหน้าเด็ก แต่หนุ่มคนนี้ก็เป็นสมาชิกที่อายุมากที่สุดในวง "
                      "มาร์คมาจาก LA สหรัฐอเมริกา และกำลังเรียนภาษาเกาหลีอยู่"
                      "\n ----------------------------------------------------------------")
            elif menuName == 3:
                print("\n\n               JACKSON "
                      "\n\n ชื่อ : Jackson (Jackson Wang) แจ็คสัน หวัง"
                      "\n วันเกิด : 28 มีนาคม 1994"
                      "\n ส่วนสูง : 174 cm"
                      "\n น้ำหนัก : 63 kg "
                      "\n การศึกษา : จบการศึกษาเกรด 11 จาก American International School"
                      "\n กรุ๊ปเลือด : o"
                      "\n งานอดิเรก : เต้น, แร็พ, บีทบ็อกซ์"
                      "\n ความสามารถพิเศษ : ฟันดาบ"
                      "\n ผู้หญิงในอุดมคติ : ผู้หญิงที่สุขภาพดีและมีเสน่ห์"
                      "\n อาหารโปรด : ช็อกโกแลต, แฮมเบอร์เกอร์, ติ่มซำ, คาโบนาร่า, ไก่"
                      "\n ศิลปินคนโปรด : Dr. Dre, G-unit (50 Cent & Lloyd Banks)"
                      "\n\n ก่อนมาเดบิวท์เป็นไอดอลที่เกาหลี แจ็คสัน มีดีกรีเป็นนักกีฬาฟันดาบทีมชาติฮ่องกงเป็นเวลาประมาณ 2 ปีครึ่ง ในวง GOT7 เขามีหน้าที่แร็พ"
                      "\n ----------------------------------------------------------------")
            elif menuName == 4:
                print("\n\n                JR."
                      "\n\n ชื่อ : Jr. (Park Jin Young) ปาร์คจินยอง"
                      "\n วันเกิด : 22 กันยายน 1994"
                      "\n ส่วนสูง : 178 ซม. "
                      "\n น้ำหนัก : 63 กก."
                      "\n การศึกษา : จบการศึกษาจาก Kyunggi High School "
                      "\n กรุ๊ปเลือด : O"
                      "\n งานอดิเรก : ดูหนัง, เดินเล่น, เปียโน"
                      "\n ความสามารถพิเศษ : เต้น"
                      "\n ผู้หญิงในอุดมคติ : ผู้หญิงที่ยิ้มเห็นฟันและเชื่อในตัวเขา"
                      "\n อารหารโปรด : แฮมเบอร์เกอร์, พิซซ่า, เนื้อ"
                      "\n ศิลปินคนโปรด : Justin Timberlake, Usher, Michael Buble"
                      "\n อีกหนึ่งหนุ่มที่เคยมีผล งานมาแล้วในฐานะ JJ Project ก่อนหน้านี้ Jr. มีหน้าที่แร็พและแสดงความน่ารัก "
                      "\n แต่ตอนนี้ในฐานะสมาชิก GOT7 เขาเป็นสมาชิกที่ทำหน้าที่ทั้งร้อง เต้น และเป็นพลังให้กับทีม"
                      "\n ----------------------------------------------------------------")
            elif menuName == 5:
                print('\n\n        CHOI YOUNG JAE'
                      '\n\n ชื่อ : ชเวยองแจ (Choi Young Jae)'
                      '\n วันเกิด : 17 กันยายน 1996'
                      '\n ส่วนสูง : 175 ซม. '
                      '\n น้ำหนัก : 59 kg '
                      '\n การศึกษา : Korea Art High School'
                      '\n กรุ๊ปเลือด : B'
                      '\n งานอดิเรก : เปียโน'
                      '\n ความสามารถพิเศษ : ร้องเพลง'
                      '\n ผู้หญิงในอุดมคติ : ผู้หญิงที่ทำให้เขารู้สึกสนใจ'
                      '\n อาหารโปรด : ทุกอย่างยกเว้นแตงกวา'
                      '\n ศิลปินคนโปรด : Elliott Yamin, Javier'
                      '\n\n หนุ่มน้อยจากมกโพ เจ้าของตำแหน่งนักร้องนำ ยองแจ เพิ่งเข้ามาอยู่ใน JYP'
                      ' ได้เพียง 7 เดือน และเป็นสมาชิกคนสุดท้ายที่เข้าร่วมวง GOT7'
                      '\n ----------------------------------------------------------------')

            elif menuName == 6:
                print('\n\n            BAMBAM'
                      '\n\n ชื่อ : แบมแบม กันต์พิมุก ภูวกุล (BamBam)'
                      '\n วันเกิด : 2 พฤษภาคม 1997'
                      '\n ส่วนสูง : 170 cm '
                      '\n น้ำหนัก : 52 kg '
                      '\n การศึกษา : โรงเรียนปราโมทย์วิทยา'
                      '\n กรุ๊ปเลือด : B'
                      '\n งานอดิเรก : ฟังเพลง '
                      '\n ความสามารถพิเศษ : เต้น'
                      '\n ผู้หญิงในอุดมคติ : ผู้หญิงที่ดูน่ารักเวลายิ้ม'
                      '\n อาหารโปรด : ชีสเบอร์เกอร์, ต้มยำกุ้ง , ส้มตำปูปลาร้าพริก2เม็ด'
                      '\n ศิลปินคนโปรด : GD'
                      '\n\n หนุ่มไทยผู้มีความฝันจะเป็นเวิร์ลสตาร์แบบเรน แบมแบม'
                      ' มีหน้าที่แร็พในวงและคิดว่าตัวเองเป็นคนที่น่ารักที่สุดใน GOT7'
                      '\n ----------------------------------------------------------------')
            elif menuName == 7:
                print('\n\n          KIM'
                      '\n\n ชื่อ : Kim Yoogyeom คิมยูคยอม'
                      '\n วันเกิด : 17 พฤศจิกายน 1997'
                      '\n ส่วนสูง : 180 ซม. '
                      '\n น้ำหนัก : 64 กก. '
                      '\n การศึกษา : street dance in Hallim High School of Performing Arts'
                      '\n กรุ๊ปเลือด : A'
                      '\n งานอดิเรก : เต้น, ร้องเพลง'
                      '\n ความสามารถพิเศษ : เต้น'
                      '\n ผู้หญิงในอุดมคติ : ผู้หญิงที่มีเสน่ห์แบบไม่เหมือนใคร'
                      '\n อาหารโปรด : ซัมกยอบซัล (หมูย่างเกาหลี), เนื้อตุ๋น, ไก่, คิมบับ'
                      '\n ศิลปินคนโปรด : Chris Brown'
                      '\n\n มักเน่ของวง (สมาชิกที่อายุน้อยที่สุด) '
                      'ถึงแม้จะดูภายนอกจะไม่ค่อยเหมือนเท่าไหร่ คิมยูคยอม รับหน้าที่เต้น ร้อง และแร็พ ใน GOT7  เขาชอบเต้นและมั่นใจ'
                      '\n ----------------------------------------------------------------')
            else:
                print(' ERROR'
                      '\n ----------------------------------------------------------------')

        if menuband == 2:
            print(" เรามีรายชื่อให้คุณเลือกดังนี้"
                  "\n 1.Jennie Kim"
                  "\n 2.Rose"
                  "\n 3.Kim Jisoo"
                  "\n 4.Lisa")
            menuName = int(input("\n ตัวเลือกของคุณคือ : "))
            if menuName == 1:
                print('\n\n          JENNIE'
                      '\n\n ชื่อ : Jennie Kim เจนนี่ คิม'
                      '\n ตำแหน่ง : แรปเปอร์ , นักร้อง'
                      '\n วันเกิด : 16 มกราคม 1996'
                      '\n สถานที่เกิด : เกาหลีใต้'
                      '\n ส่วนสูง : 163 ซม.'
                      '\n IG : @jennierubyjane'
                      '\n ----------------------------------------------------------------')
            elif menuName == 2:
                print('\n\n      ROSE'
                      '\n\n ชื่อ : Rose โรเซ่'
                      '\n ตำแหน่ง : นักร้อง'
                      '\n วันเกิด : 11 กุมภาพันธ์ 1997'
                      '\n สถานที่เกิด : ออกแลนด์ นิวซีแลนด์'
                      '\n ส่วนสูง : 168 ซม.'
                      '\n IG : @roses_are_rosie'
                      '\n ----------------------------------------------------------------')
            elif menuName == 3:
                print('\n\n        JISOO'
                      '\n\n ชื่อ : Kim Jisoo คิม จีซู'
                      '\n ตำแหน่ง : นักร้อง'
                      '\n วันเกิด :3 มกราคม  1995'
                      '\n สถานที่เกิด : โซล เกาหลีใต้'
                      '\n ส่วนสูง : 162 ซม.'
                      '\n IG : @sooyaaa_'
                      '\n ----------------------------------------------------------------')
            elif menuName == 4:
                print('\n\n                 LISA'
                      '\n\n ชื่อ : Lisa ลิซ่า  (ลลิษา มโนบาล ชื่อเล่น ป๊อกแป๊ก)'
                      '\n ตำแหน่ง : แรปเปอร์, เต้นหลัก, มักเน่'
                      '\n วันเกิด : 27 มีนาคม 1997'
                      '\n สถานที่เกิด : ประเทศไทย'
                      '\n ส่วนสูง : 167 ซม.'
                      '\n IG : @lalalalisa_m'
                      '\n ----------------------------------------------------------------')
            else:
                print(' ERROR')

        if menuband == 3:
            print(" เรามีรายชื่อให้คุณเลือกดังนี้"
                  "\n 1.RM"
                  "\n 2.JIN"
                  "\n 3.SUGA"
                  "\n 4.J-HOPE"
                  "\n 5.JIMIN"
                  "\n 6.V"
                  "\n 7.JUNGKOOK")
            menuName = int(input("\n ตัวเลือกของคุณคือ : "))
            if menuName == 1:
                print('\n\n          RM'
                      '\n\n ชื่อในวงการ : RM {아엠,อาร์เอ็ม}'
                      '\n - อัพเดตล่าสุดเมื่อ 13 พ.ย. 2017'
                      '\n ชื่อจริง : Kim Nam-joon [คิม นัมจุน]'
                      '\n ชื่อภาษาเกาหลี : 김남준'
                      '\n วันเกิด : 12 กันยายน พ.ศ. 2537 (ค.ศ.1994)'
                      '\n อายุ(ไทย) : 23 อายุ(เกา) : 24'
                      '\n ราศี : กันย์'
                      '\n กรุ๊ปเลือด : ​A'
                      '\n น้ำหนัก : 64 kg.'
                      '\n ส่วนสูง : 181 cm.'
                      '\n ตำแหน่ง : (หัวหน้าวง) แร็ปเปอร์หลัก'
                      '\n ----------------------------------------------------------------')
            elif menuName == 2:
                print('\n\n          JIN'
                      '\n\n ชื่อในวงการ : JIN {진,จิน}'
                      '\n ชื่อจริง :Kim Seok-jin [คิม ซอกจิน]'
                      '\n ชื่อภาษาเกาหลี : 김석진'
                      '\n วันเกิด : 04 ธันวาคม พ.ศ. 2535 (ค.ศ.1992)'
                      '\n อายุ(ไทย) : 25 อายุ(เกา) : 26'
                      '\n ราศี : ธนู'
                      '\n กรุ๊ปเลือด : O'
                      '\n น้ำหนัก : 60 kg. '
                      '\n ส่วนสูง : 179 cm.'
                      '\n ตำแหน่ง : เสียงร้อง ภาพลักษณ์ของวง'
                      '\n ----------------------------------------------------------------')
            elif menuName == 3:
                print('\n\n          SUGA'
                      '\n\n ชื่อในวงการ : SUGA {슈가,ชูก้า}'
                      '\n ชื่อจริง : Min Yoon-gi [มิน ยุนกิ]'
                      '\n ชื่อภาษาเกาหลี : 민윤기'
                      '\n วันเกิด : 09 มีนาคม พ.ศ. 2536 (ค.ศ.1993)'
                      '\n อายุ(ไทย) : 24 อายุ(เกา) : 25'
                      '\n ราศี : มีน'
                      '\n กรุ๊ปเลือด : O'
                      '\n น้ำหนัก : 57 kg.'
                      '\n ส่วนสูง : 174 cm.'
                      '\n ตำแหน่ง : แร็ปเปอร์หลัก'
                      '\n ----------------------------------------------------------------')
            elif menuName == 4:
                print('\n\n          J-HOPE'
                      '\n\n ชื่อในวงการ : J-HOPE {제이홉,เจ-โฮป}'
                      '\n ชื่อจริง : Jung Ho-seok [จอง โฮซอก]'
                      '\n ชื่อภาษาเกาหลี :정호석'
                      '\n วันเกิด : 18 กุมภาพันธ์ พ.ศ. 2537 (ค.ศ.1994)'
                      '\n อายุ(ไทย) : 23 อายุ(เกา) : 24'
                      '\n ราศี : กุมภ์'
                      '\n กรุ๊ปเลือด : A'
                      '\n น้ำหนัก : 59 kg.'
                      '\n ส่วนสูง : 177cm.'
                      '\n ตำแหน่ง : แร็ปเปอร์หลัก นักเต้นหลัก'
                      '\n ----------------------------------------------------------------')
            elif menuName == 5:
                print('\n\n          JIMIN'
                      '\n\n ชื่อในวงการ : JIMIN {지민,จีมิน}'
                      '\n ชื่อจริง : Park Ji-min [พัก จีมิน]'
                      '\n ชื่อภาษาเกาหลี : 박지민'
                      '\n วันเกิด : 13 ตุลาคม พ.ศ. 2538 (ค.ศ.1995)'
                      '\n อายุ(ไทย) : 22 อายุ(เกา) : 23'
                      '\n ราศี : ตุลย์'
                      '\n กรุ๊ปเลือด : A'
                      '\n น้ำหนัก : 60 kg.'
                      '\n ส่วนสูง : 173 cm.'
                      '\n ตำแหน่ง : นักร้องนำ นักเต้นหลัก'
                      '\n ----------------------------------------------------------------')
            elif menuName == 6:
                print('\n\n            V'
                      '\n\n ชื่อในวงการ : V {뷔,วี}'
                      '\n ชื่อจริง : Kim Tae-hyung [คิม แทฮยอง]'
                      '\n ชื่อภาษาเกาหลี : 김태형'
                      '\n วันเกิด : 30 ธันวาคม พ.ศ. 2538 (ค.ศ.1995)'
                      '\n อายุ(ไทย) : 22 อายุ(เกา) : 23'
                      '\n ราศี : มังกร'
                      '\n กรุ๊ปเลือด : AB'
                      '\n วันเกิด : 30 ธันวาคม 1995'
                      '\n น้ำหนัก : 58 kg.'
                      '\n ส่วนสูง : 178 cm.'
                      '\n ตำแหน่ง : นักร้องเสียงหลัก'
                      '\n ----------------------------------------------------------------')
            elif menuName == 7:
                print('\n\n          JUNGKOOK'
                      '\n\n ชื่อในวงการ : JUNGKOOK {정국,จองกุก}'
                      '\n ชื่อจริง : Jeon Jung-kook [จอน จองกุก]'
                      '\n ชื่อภาษาเกาหลี : 전정국'
                      '\n วันเกิด : 01 กันยายน พ.ศ. 2540 (ค.ศ.1997)'
                      '\n อายุ(ไทย) : 20 อายุ(เกา) : 21'
                      '\n ราศี : กันย์'
                      '\n กรุ๊ปเลือด : A'
                      '\n น้ำหนัก : 61 kg.'
                      '\n ส่วนสูง : 178 cm.'
                      '\n ตำแหน่ง : นักร้องเสียงหลัก นักเต้นหลัก แร็ปเปอร์นำ มักเน่'
                      '\n ----------------------------------------------------------------')
            else:
                print( 'ERROR'
                       '\n ----------------------------------------------------------------')





else:
    print(" รหัสผ่านของคุณไม่ถูกต้อง"
          "\n ----------------------------------------------------------------")
